fio_test/media_fio.txt
seq-write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
seq-read: (g=1): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
special-vdev-iops-write: (g=2): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
special-vdev-iops-read: (g=3): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.33
Starting 4 processes
seq-write: Laying out IO file (1 file / 2048MiB)

seq-write: (groupid=0, jobs=1): err= 0: pid=13342: Fri Jun  5 15:06:41 2026
  write: IOPS=369, BW=369MiB/s (387MB/s)(2048MiB/5544msec); 0 zone resets
    slat (usec): min=1887, max=59402, avg=2628.64, stdev=2539.90
    clat (usec): min=2, max=246083, avg=80569.69, stdev=23021.33
     lat (msec): min=2, max=248, avg=83.20, stdev=23.54
    clat percentiles (msec):
     |  1.00th=[   52],  5.00th=[   69], 10.00th=[   72], 20.00th=[   73],
     | 30.00th=[   73], 40.00th=[   73], 50.00th=[   74], 60.00th=[   74],
     | 70.00th=[   75], 80.00th=[   80], 90.00th=[  108], 95.00th=[  136],
     | 99.00th=[  182], 99.50th=[  197], 99.90th=[  228], 99.95th=[  243],
     | 99.99th=[  247]
   bw (  KiB/s): min=227735, max=432128, per=100.00%, avg=385269.50, stdev=67069.32, samples=10
   iops        : min=  222, max=  422, avg=376.20, stdev=65.60, samples=10
  lat (usec)   : 4=0.05%
  lat (msec)   : 4=0.05%, 10=0.10%, 20=0.20%, 50=0.59%, 100=87.84%
  lat (msec)   : 250=11.18%
  cpu          : usr=1.15%, sys=43.60%, ctx=2078, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.4%, 16=0.8%, 32=98.5%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2048,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
seq-read: (groupid=1, jobs=1): err= 0: pid=13368: Fri Jun  5 15:06:41 2026
  read: IOPS=142, BW=142MiB/s (149MB/s)(2048MiB/14385msec)
    slat (usec): min=1411, max=52614, avg=7019.40, stdev=3976.78
    clat (usec): min=2, max=396288, avg=214460.24, stdev=68272.87
     lat (msec): min=7, max=406, avg=221.48, stdev=70.22
    clat percentiles (msec):
     |  1.00th=[   93],  5.00th=[  138], 10.00th=[  142], 20.00th=[  150],
     | 30.00th=[  159], 40.00th=[  171], 50.00th=[  188], 60.00th=[  253],
     | 70.00th=[  275], 80.00th=[  288], 90.00th=[  300], 95.00th=[  321],
     | 99.00th=[  347], 99.50th=[  380], 99.90th=[  397], 99.95th=[  397],
     | 99.99th=[  397]
   bw (  KiB/s): min=36571, max=223232, per=98.79%, avg=144029.64, stdev=48052.01, samples=28
   iops        : min=   35, max=  218, avg=140.61, stdev=46.97, samples=28
  lat (usec)   : 4=0.05%
  lat (msec)   : 10=0.05%, 20=0.10%, 50=0.24%, 100=0.68%, 250=58.64%
  lat (msec)   : 500=40.23%
  cpu          : usr=0.10%, sys=0.49%, ctx=2062, majf=0, minf=31
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.4%, 16=0.8%, 32=98.5%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=2048,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
special-vdev-iops-write: (groupid=2, jobs=1): err= 0: pid=13518: Fri Jun  5 15:06:41 2026
  write: IOPS=98, BW=400KiB/s (410kB/s)(11.7MiB/30031msec); 0 zone resets
    slat (usec): min=3, max=803757, avg=10087.00, stdev=32409.88
    clat (usec): min=3, max=1833.7k, avg=310459.83, stdev=277367.77
     lat (msec): min=9, max=1843, avg=320.50, stdev=282.26
    clat percentiles (msec):
     |  1.00th=[  146],  5.00th=[  178], 10.00th=[  192], 20.00th=[  209],
     | 30.00th=[  220], 40.00th=[  228], 50.00th=[  236], 60.00th=[  247],
     | 70.00th=[  259], 80.00th=[  275], 90.00th=[  313], 95.00th=[ 1234],
     | 99.00th=[ 1452], 99.50th=[ 1502], 99.90th=[ 1804], 99.95th=[ 1821],
     | 99.99th=[ 1838]
   bw (  KiB/s): min=   16, max=  688, per=100.00%, avg=417.30, stdev=190.06, samples=57
   iops        : min=    4, max=  172, avg=104.32, stdev=47.51, samples=57
  lat (usec)   : 4=0.03%
  lat (msec)   : 10=0.03%, 50=0.13%, 100=0.20%, 250=62.53%, 500=30.54%
  lat (msec)   : 750=0.67%, 1000=1.04%, 2000=5.85%
  cpu          : usr=0.05%, sys=0.53%, ctx=2470, majf=0, minf=36
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2973,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
special-vdev-iops-read: (groupid=3, jobs=1): err= 0: pid=14039: Fri Jun  5 15:06:41 2026
  read: IOPS=127, BW=515KiB/s (527kB/s)(15.1MiB/30017msec)
    slat (usec): min=2, max=76322, avg=7832.52, stdev=4912.45
    clat (usec): min=5, max=333895, avg=241833.91, stdev=29637.57
     lat (msec): min=17, max=340, avg=249.67, stdev=30.00
    clat percentiles (msec):
     |  1.00th=[  174],  5.00th=[  199], 10.00th=[  207], 20.00th=[  220],
     | 30.00th=[  228], 40.00th=[  234], 50.00th=[  243], 60.00th=[  249],
     | 70.00th=[  255], 80.00th=[  266], 90.00th=[  279], 95.00th=[  292],
     | 99.00th=[  313], 99.50th=[  317], 99.90th=[  330], 99.95th=[  330],
     | 99.99th=[  334]
   bw (  KiB/s): min=  416, max=  616, per=99.07%, avg=510.68, stdev=42.84, samples=60
   iops        : min=  104, max=  154, avg=127.67, stdev=10.71, samples=60
  lat (usec)   : 10=0.03%
  lat (msec)   : 20=0.03%, 50=0.08%, 100=0.10%, 250=62.80%, 500=37.77%
  cpu          : usr=0.05%, sys=0.49%, ctx=3692, majf=0, minf=36
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=3831,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=369MiB/s (387MB/s), 369MiB/s-369MiB/s (387MB/s-387MB/s), io=2048MiB (2147MB), run=5544-5544msec

Run status group 1 (all jobs):
   READ: bw=142MiB/s (149MB/s), 142MiB/s-142MiB/s (149MB/s-149MB/s), io=2048MiB (2147MB), run=14385-14385msec

Run status group 2 (all jobs):
  WRITE: bw=400KiB/s (410kB/s), 400KiB/s-400KiB/s (410kB/s-410kB/s), io=11.7MiB (12.3MB), run=30031-30031msec

Run status group 3 (all jobs):
   READ: bw=515KiB/s (527kB/s), 515KiB/s-515KiB/s (527kB/s-527kB/s), io=15.1MiB (15.8MB), run=30017-30017msec